In [1]:
import pandas as pd

In [2]:
convertir = pd.read_excel('estudiantes.xlsx')

In [4]:
convertir.to_csv('estudiantes.csv', index=None, header =True)

In [24]:
df = pd.read_csv('estudiantes.csv')

In [8]:
df

      NOMBRE   EDAD GENERO      CARRERA  SEMESTRE
0     Victor     28      M     Auditoria  Primero
1  Francisco     28      M   Informatica   Noveno
2       Raul     26      M       Derecho   Quinto
3    Mariana     27      F  Arquitectura  Septimo
4    Gustavo     22      M       Derecho   Cuarto
5      Sofia     20      F    Enfermeria  Segundo

In [10]:
df.iloc[1,3]

'Informatica'

In [15]:
df.iloc[2,:4]

NOMBRE         Raul
 EDAD            26
GENERO            M
CARRERA     Derecho
Name: 2, dtype: object

In [25]:
df.loc[2,'EDAD']

26